// carcassonne-server/data/tileDefinitions.js

/**
 * Определения областей плиток для игры Carcassonne
 * Содержит данные об областях плиток, включая их тип и координаты полигонов
 * для визуального отображения на фронтенде
 */
const tileDefinitions = {
  photo1: [
    {
      name: "cityArea",
      type: "city",
      // Верхняя область – город (например, верхняя 40% плитки)
      polygon: [[0.0, 0.0], [0.2, 0.24], [0.46, 0.29], [0.81, 0.17], [1.0, 0.0]]
    },
    {
      name: "roadArea",
      type: "road",
      // Центральная область – дорога
      polygon: [
        [0.0, 0.53],
        [0.26, 0.56],
        [0.34, 0.61],
        [0.4, 0.71],
        [0.49, 0.78],
        [0.47, 1.0],
        [0.54, 1.0],
        [0.54, 0.81],
        [0.56, 0.76],
        [0.51, 0.71],
        [0.41, 0.61],
        [0.38, 0.52],
        [0.29, 0.49],
        [0.0, 0.48]
    ]
    },
    {
      name: "fieldAreaLeft", // левая часть поля
      type: "field",
      polygon: [
        [0.53, 1.0],
        [0.57, 0.74],
        [0.39, 0.54],
        [0.31, 0.48],
        [0.0, 0.47],
        [0.0, 0.0],
        [0.2, 0.26],
        [0.46, 0.29],
        [0.8, 0.17],
        [0.93, 0.07],
        [1.0, 0.0],
        [1.0, 1.0]
    ]
    },
    {
      name: "fieldAreaRight", // правая часть поля
      type: "field",
      polygon: [
        [0.0, 0.53],
        [0.24, 0.56],
        [0.32, 0.6],
        [0.38, 0.68],
        [0.43, 0.73],
        [0.49, 0.8],
        [0.47, 1.0],
        [0.0, 1.0]
    ]
    }
  ],
  photo2: [
    {
      name: "fieldAreaLeft", // левая часть поля
      type: "field",
      polygon: [
        [0.0, 0.46],
        [0.1, 0.48],
        [0.19, 0.46],
        [0.32, 0.44],
        [0.41, 0.44],
        [0.49, 0.49],
        [0.54, 0.56],
        [0.56, 0.64],
        [0.56, 0.71],
        [0.6, 0.77],
        [0.59, 0.84],
        [0.57, 1.0],
        [1.0, 1.0],
        [1.0, 0.0],
        [0.0, 0.0]
    ]
    },
    {
      name: "fieldAreaRight", // правая часть поля
      type: "field",
      polygon: [
        [0.0, 0.53],
        [0.09, 0.54],
        [0.17, 0.52],
        [0.29, 0.52],
        [0.37, 0.52],
        [0.46, 0.56],
        [0.49, 0.68],
        [0.5, 0.76],
        [0.51, 0.83],
        [0.49, 0.89],
        [0.49, 1.0],
        [0.0, 1.0]
    ]
    },
    {
      name: "roadArea",
      type: "road",
      // Нижняя область – дорога
      polygon: [
        [0.0, 0.47],
        [0.16, 0.47],
        [0.38, 0.44],
        [0.49, 0.48],
        [0.56, 0.57],
        [0.56, 0.69],
        [0.59, 0.78],
        [0.6, 0.81],
        [0.58, 0.88],
        [0.56, 1.0],
        [0.5, 1.0],
        [0.52, 0.81],
        [0.5, 0.72],
        [0.48, 0.69],
        [0.48, 0.61],
        [0.42, 0.54],
        [0.32, 0.51],
        [0.24, 0.52],
        [0.0, 0.53]
    ]
    }
  ]
};

module.exports = tileDefinitions;